<?php
$title="<TITLE>Homework3question9</TITLE>";
echo $title;

echo "
9. *Объединить две ранее написанные функции в одну, которая получает строку на русском языке, <br>
производит транслитерацию и замену пробелов на подчеркивания <br>
(аналогичная задача решается при конструировании url-адресов на основе названия статьи в блогах).
<hr><br>";

function Transliteraciya($string) { //функция транслитерации
    $replace=array(
        "'"=>"",
        "`"=>"",
        "а"=>"a","А"=>"a", "б"=>"b","Б"=>"b", "в"=>"v","В"=>"v", "г"=>"g","Г"=>"g", "д"=>"d","Д"=>"d", "е"=>"e","Е"=>"e",
        "ж"=>"zh","Ж"=>"zh", "з"=>"z","З"=>"z", "и"=>"i","И"=>"i", "й"=>"y","Й"=>"y", "к"=>"k","К"=>"k","л"=>"l","Л"=>"l",
        "м"=>"m","М"=>"m", "н"=>"n","Н"=>"n", "о"=>"o","О"=>"o", "п"=>"p","П"=>"p", "р"=>"r","Р"=>"r", "с"=>"s","С"=>"s",
        "т"=>"t","Т"=>"t", "у"=>"u","У"=>"u", "ф"=>"f","Ф"=>"f", "х"=>"h","Х"=>"h", "ц"=>"c","Ц"=>"c", "ч"=>"ch","Ч"=>"ch",
        "ш"=>"sh","Ш"=>"sh", "щ"=>"sch","Щ"=>"sch", "ъ"=>"","Ъ"=>"", "ы"=>"y","Ы"=>"y", "ь"=>"","Ь"=>"", "э"=>"e","Э"=>"e",
        "ю"=>"yu","Ю"=>"yu", "я"=>"ya","Я"=>"ya", "і"=>"i","І"=>"i", "ї"=>"yi","Ї"=>"yi", "є"=>"e","Є"=>"e"
    );
    return $str=iconv("UTF-8","UTF-8//IGNORE",strtr($string,$replace));
};

function Replace($str){ //функция замены пробелов на подчеркивания
    $aWords = explode(' ', $str);
    return implode('_', $aWords);
};

function TextToUrl($string){ //по очереди вызываем обе ранее описанные функции
    $string=Transliteraciya($string);
    return Replace($string);
}

$string="Приветствую Вас дорогие друзья!";
echo $string."<br>";
$string=TextToUrl($string);
echo $string;


?>